src/test/resources/dk/apaq/economic/repository/draftinvoices_list.json

{
  "collection": [
    {
      "draftInvoiceNumber": 35183,
      "soap": {
        "currentInvoiceHandle": {
          "id": 47
        }
      },
      "templates": {
        "bookingInstructions": "https://restapi.e-conomic.com/invoices/drafts/35183/templates/booking-instructions",
        "self": "https://restapi.e-conomic.com/invoices/drafts/35183/templates"
      },
      "date": "2019-02-11",
      "currency": "DKK",
      "exchangeRate": 100.000000,
      "netAmount": 0.000000,
      "netAmountInBaseCurrency": 0.00,
      "grossAmount": 0.000000,
      "grossAmountInBaseCurrency": 0.00,
      "marginInBaseCurrency": 0.0000,
      "marginPercentage": 0.0,
      "vatAmount": 0.000000,
      "roundingAmount": 0.00,
      "costPriceInBaseCurrency": 0.0000,
      "dueDate": "2019-02-19",
      "paymentTerms": {
        "paymentTermsNumber": 1,
        "daysOfCredit": 8,
        "name": "Netto 8 dage",
        "paymentTermsType": "net",
        "self": "https://restapi.e-conomic.com/payment-terms/1"
      },
      "customer": {
        "customerNumber": 1,
        "self": "https://restapi.e-conomic.com/customers/1"
      },
      "recipient": {
        "name": "Lix Technologies",
        "address": "Klamsagervej 23",
        "zip": "8230",
        "city": "Åbyhøj",
        "country": "Denmark",
        "vatZone": {
          "name": "Abroad",
          "vatZoneNumber": 3,
          "enabledForCustomer": true,
          "enabledForSupplier": true,
          "self": "https://restapi.e-conomic.com/vat-zones/3"
        }
      },
      "references": {
        "other": "f90d1f23-2be0-4a3f-a964-b301427c40ca"
      },
      "layout": {
        "layoutNumber": 19,
        "self": "https://restapi.e-conomic.com/layouts/19"
      },
      "pdf": {
        "download": "https://restapi.e-conomic.com/invoices/drafts/35183/pdf"
      },
      "self": "https://restapi.e-conomic.com/invoices/drafts/35183"
    },
    {
      "draftInvoiceNumber": 35199,
      "soap": {
        "currentInvoiceHandle": {
          "id": 48
        }
      },
      "templates": {
        "bookingInstructions": "https://restapi.e-conomic.com/invoices/drafts/35199/templates/booking-instructions",
        "self": "https://restapi.e-conomic.com/invoices/drafts/35199/templates"
      },
      "date": "2019-02-12",
      "currency": "DKK",
      "exchangeRate": 100.000000,
      "netAmount": 100.000000,
      "netAmountInBaseCurrency": 100.00,
      "grossAmount": 125.000000,
      "grossAmountInBaseCurrency": 125.00,
      "marginInBaseCurrency": 100.0000,
      "marginPercentage": 100.00,
      "vatAmount": 25.000000,
      "roundingAmount": 0.00,
      "costPriceInBaseCurrency": 0.0000,
      "dueDate": "2019-02-20",
      "paymentTerms": {
        "paymentTermsNumber": 1,
        "daysOfCredit": 8,
        "name": "Netto 8 dage",
        "paymentTermsType": "net",
        "self": "https://restapi.e-conomic.com/payment-terms/1"
      },
      "customer": {
        "customerNumber": 1,
        "self": "https://restapi.e-conomic.com/customers/1"
      },
      "recipient": {
        "name": "Addwish Company",
        "address": "Vejen 1",
        "zip": "1234",
        "city": "Storeby",
        "country": "Denmark",
        "vatZone": {
          "name": "Domestic",
          "vatZoneNumber": 1,
          "enabledForCustomer": true,
          "enabledForSupplier": true,
          "self": "https://restapi.e-conomic.com/vat-zones/1"
        }
      },
      "layout": {
        "layoutNumber": 19,
        "self": "https://restapi.e-conomic.com/layouts/19"
      },
      "pdf": {
        "download": "https://restapi.e-conomic.com/invoices/drafts/35199/pdf"
      },
      "self": "https://restapi.e-conomic.com/invoices/drafts/35199"
    },
    {
      "draftInvoiceNumber": 35200,
      "soap": {
        "currentInvoiceHandle": {
          "id": 49
        }
      },
      "templates": {
        "bookingInstructions": "https://restapi.e-conomic.com/invoices/drafts/35200/templates/booking-instructions",
        "self": "https://restapi.e-conomic.com/invoices/drafts/35200/templates"
      },
      "date": "2019-02-12",
      "currency": "DKK",
      "exchangeRate": 100.000000,
      "netAmount": 0.000000,
      "netAmountInBaseCurrency": 0.00,
      "grossAmount": 0.000000,
      "grossAmountInBaseCurrency": 0.00,
      "marginInBaseCurrency": 0.0000,
      "marginPercentage": 0.0,
      "vatAmount": 0.000000,
      "roundingAmount": 0.00,
      "costPriceInBaseCurrency": 0.0000,
      "dueDate": "2019-02-20",
      "paymentTerms": {
        "paymentTermsNumber": 1,
        "daysOfCredit": 8,
        "name": "Netto 8 dage",
        "paymentTermsType": "net",
        "self": "https://restapi.e-conomic.com/payment-terms/1"
      },
      "customer": {
        "customerNumber": 1,
        "self": "https://restapi.e-conomic.com/customers/1"
      },
      "recipient": {
        "name": "Lix Technologies",
        "address": "Klamsagervej 23",
        "zip": "8230",
        "city": "Åbyhøj",
        "country": "Denmark",
        "vatZone": {
          "name": "Abroad",
          "vatZoneNumber": 3,
          "enabledForCustomer": true,
          "enabledForSupplier": true,
          "self": "https://restapi.e-conomic.com/vat-zones/3"
        }
      },
      "references": {
        "other": "37e12a46-78aa-493b-a890-302b67a29aad"
      },
      "layout": {
        "layoutNumber": 19,
        "self": "https://restapi.e-conomic.com/layouts/19"
      },
      "pdf": {
        "download": "https://restapi.e-conomic.com/invoices/drafts/35200/pdf"
      },
      "self": "https://restapi.e-conomic.com/invoices/drafts/35200"
    }
  ],
  "pagination": {
    "maxPageSizeAllowed": 1000,
    "skipPages": 0,
    "pageSize": 20,
    "results": 7308,
    "resultsWithoutFilter": 7308,
    "firstPage": "https://restapi.e-conomic.com/invoices/drafts?skippages=0&pagesize=20",
    "nextPage": "https://restapi.e-conomic.com/invoices/drafts?skippages=1&pagesize=20",
    "lastPage": "https://restapi.e-conomic.com/invoices/drafts?skippages=365&pagesize=20"
  },
  "self": "https://restapi.e-conomic.com/invoices/drafts"
}